app/controllers/clients_controller.rb

SELECT "clients".* FROM "clients"
SELECT "movies".* FROM "movies" WHERE "movies"."client_id" = $1 ORDER BY "movies"."id" DESC LIMIT $2  [["client_id", 1], ["LIMIT", 1]]
---
  def index
    @clients = Client.all
    @movies = Movie.all

INSERT INTO "clients" ("name", "age", "created_at", "updated_at", "movie_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "rr"], ["age", "45"], ["created_at", "2023-07-16 23:38:31.989481"], ["updated_at", "2023-07-16 23:38:31.989481"], ["movie_id", 4]]
---
  def create
    @client = Client.new(client_params)

    respond_to do |format|
      if @client.save

DELETE FROM "clients" WHERE "clients"."id" = $1  [["id", 13]]
---
  def destroy
    @client.destroy

SELECT "movies"."name", "movies"."id" FROM "movies"
---
    def set_movies
      @movies = Movie.all.pluck :name, :id