app/controllers/movies_controller.rb

  def create
    @movie = Movie.new(movie_params)

    respond_to do |format|
      if @movie.save
---
INSERT INTO "movies" ("name", "created_at", "updated_at", "client_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "5"], ["created_at", "2023-07-16 23:35:14.943420"], ["updated_at", "2023-07-16 23:35:14.943420"], ["client_id", nil]]

  def update
    respond_to do |format|
      if @movie.update(movie_params)
---
UPDATE "movies" SET "updated_at" = $1, "client_id" = $2 WHERE "movies"."id" = $3  [["updated_at", "2023-07-05 23:59:19.906752"], ["client_id", 2], ["id", 1]]

    def set_clients
      @clients = Client.all.pluck :name, :id
---
SELECT "clients"."name", "clients"."id" FROM "clients"